src/CF/Catalogs/Договора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Договора</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Клиенты</xr:Item>
				<xr:Item>Catalog.Поставщики</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредусматриваетСтрогиеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничиваетСуммуТоваров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничиваетСуммуЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничиваетКоличествоТоваров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливаетСрокОплатыВДнях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДенег</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыВзаиморасчетовДляНалоговыхНакладныхУкраины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссионногоВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯзыкДокументации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/Договора/Ext/ObjectModule.bsl
//sza140411-1659 : 
//sza131116-2308
Функция   АвтоНаменованиеДоговораНаСервере() Экспорт
	
	НаименованиеС = ?(ЗначениеЗаполнено(Организация), Организация + ?(ЗначениеЗаполнено(КлиентПоставщик), " - ", ""), "") + ?(ЗначениеЗаполнено(КлиентПоставщик), КлиентПоставщик, "") + ?(ЗначениеЗаполнено(НомерДоговора), НомерДоговора, "") + ?(ЗначениеЗаполнено(ДатаЗаключения), ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("от") + ДатаЗаключения, "");
	Если ЗначениеЗаполнено(ОграничиваетСуммуЗадолженности) Тогда
		НаименованиеС = НаименованиеС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" на сумму") + " " + ОграничиваетСуммуЗадолженности;
	ИначеЕсли ЗначениеЗаполнено(ОграничиваетСуммуТоваров) Тогда
		НаименованиеС = НаименованиеС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" на сумму товаров") + " " + ОграничиваетСуммуТоваров;
	ИначеЕсли ЗначениеЗаполнено(ОграничиваетКоличествоТоваров) Тогда
		НаименованиеС = НаименованиеС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" на количество товаров") + " " + ОграничиваетКоличествоТоваров;
	ИначеЕсли ЗначениеЗаполнено(ПредусматриваетСтрогиеЦены) Тогда
		НаименованиеС = НаименованиеС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" о Ценах");
	ИначеЕсли ЗначениеЗаполнено(УстанавливаетСрокОплатыВДнях) Тогда
		НаименованиеС = НаименованиеС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" о сроке оплат в") + " " + УстанавливаетСрокОплатыВДнях + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" дней");
	КонецЕсли;
	
	Возврат НаименованиеС;
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Клиенты") Тогда
		ВидЦен 			= ДанныеЗаполнения.ВидЦен;
		Комментарий 	= ДанныеЗаполнения.Комментарий;
		Наименование 	= ДанныеЗаполнения.Наименование;
		КлиентПоставщик = ДанныеЗаполнения.Ссылка;
		ХранилищеДенег 	= ДанныеЗаполнения.ХранилищеДенег;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Поставщики") Тогда
		ВидЦен 			= ДанныеЗаполнения.ВидЦен;
		Комментарий 	= ДанныеЗаполнения.Комментарий;
		Наименование 	= ДанныеЗаполнения.Наименование;
		КлиентПоставщик = ДанныеЗаполнения.Ссылка;
		ХранилищеДенег 	= ДанныеЗаполнения.ХранилищеДенег;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И НЕ ПометкаУдаления Тогда
		
		Если НЕ ЗначениеЗаполнено(Наименование) Тогда		
			АвтоНаменованиеДоговораНаСервере();
		КонецЕсли;
		
		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(Наименование, Ссылка, , Отказ);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры
